Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_CARBON
The Carbon configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_GRAPHITE
The Graphite configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_DIAMOND
The Diamond configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_MEP
The MEP configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_TRIAL
The Trial Configuration.

Tekla.Structures.ModuleManager.ProgramConfigurationEnum.CONFIGURATION_PLATFORM
The Tekla Platform configuration.